from thaiticket import WebController, Account, Hall, HallSeat, Zone, Event, Show

def create_instance():
    Hall_1 = Hall('JJ HALL ชั้น 6 ศูนย์การค้าเจเจมอลล์')
    Event_1 = Event('2024 NA IN WOO Fan Meeting in Bangkok Touch my heart','23-03-2567',Hall_1,'2-03-2567-10:00-AM','ON SALE NOW',
'''ช่องทางการจำหน่ายบัตรและชำระเงิน
เริ่มจำหน่ายบัตร วันเสาร์ที่ 2 มีนาคม 2567 ตั้งแต่เวลา 10.00 น. เป็นต้นไป ทุกช่องทางการจำหน่าย โดยการจำหน่ายบัตรช่วงเวลา 10.00 - 23.59 น. จะเปิดจำหน่ายบัตรและชำระเงินเฉพาะช่องทางดังต่อไปนี้
1. เคาน์เตอร์ไทยทิคเก็ตเมเจอร์ 11 สาขาหลัก / โรงภาพยนตร์เมเจอร์ซีนีเพล็กซ์และอีจีวี / ไปรษณีย์ไทย / บิ๊กซี และ โลตัส
ตรวจสอบจุดจำหน่ายได้ที่ >> https://corporate.thaiticketmajor.com/outlet-location.php
สามารถชำระเงินได้ดังนี้
1.1 บัตรเครดิตหรือบัตรเดบิต (Convenience fee 3%)
1.2 เงินสด
 
2. ทางเว็บไซต์ www.thaiticketmajor.com *ไม่มีการรันคิวหน้าเว็บไซต์*
สามารถชำระเงินได้ดังนี้
2.1 บัตรเครดิตหรือบัตรเดบิต (Convenience fee 3%)
2.2 ชำระทันทีผ่านแอปพลิเคชัน K Pay Plus, BBL iBanking (Convenience fee 0.5%) / Shopee Pay, True Money, Alipay, WeChat pay (Convenience fee 3%)
 
3. ทาง TTM Call Center 02-262-3456 สามารถชำระเงินได้ดังนี้
3.1 ชำระทันทีผ่านแอปพลิเคชัน K Pay Plus (Convenience fee 0.5%)
 
**และวันอาทิตย์ที่ 3 มีนาคม 2567 เวลา 00.01 น. เป็นต้นไป จะเปิดจำหน่ายบัตรและชำระเงินผ่านทุกช่องทางตามปกติ**
 
* ติดตามรายละเอียดเพิ่มเติมได้ผ่านช่องทาง 
Facebook Fanpage : facebook.com/ SimpleP.Entertainment
Twitter : twitter.com/ SimpleP.Entertainment
IG : SimpleP.Entertainment
TikTok : SimpleP.Entertainment 
 
** สอบถามรายละเอียดการซื้อบัตรเพิ่มเติม TTM Call Center 02-262-3456 หรือ cs@thaiticketmajor.com
เงื่อนไขการซื้อบัตร :
- จำกัดการซื้อทุกช่องทาง 1 ท่านต่อบัตร 6 ใบ 
- ราคาบัตรยังไม่รวมค่าธรรมเนียมการออกบัตรใบละ 30 บาท 
- เด็กที่มีความสูงเกิน 100 เซนติเมตร จะต้องมีบัตรในการเข้างาน
- ใช้บัตรกระดาษในการเข้างาน 
- โปรดระวังมิจฉาชีพที่แฝงมาในรูปแบบต่างๆ เช่น การรับจองบัตร การให้โค้ดจอง การซื้อ-ขายบัตรนอกระบบ การแอบอ้างเป็นพนักงานบริษัทฯ เป็นต้น
- การนำบัตรไปขายต่อหรือแจกเพื่อการโฆษณาหรือประชาสัมพันธ์โดยไม่ได้รับอนุญาตจากบริษัทฯ ถือว่ามีความผิดทางกฎหมาย
- การนำบัตรไปขายต่อเพิ่มราคา หากตรวจสอบและพบหลักฐานการทำความผิด ทางบริษัทฯ ขอสงวนสิทธิ์ในการยกเลิกการจองในกรณียังไม่ชำระเงินหรือยกเลิกบัตรเป็นโมฆะในกรณีที่ชำระเงินแล้ว 
และนำบัตรกลับคืนสู่ระบบเพื่อจำหน่ายใหม่อีกครั้ง''')

    Event_1_Show_1 = Show(Event_1,'23-03-2567','18:00-PM')

    Event_1_zone_A1 = Zone('A1','6500',['AA','AB','AC','AD','AE','AF'],[1,16])
    Event_1_zone_A2 = Zone('A2','6500',['AA','AB','AC','AD','AE','AF'],[17,34])
    Event_1_zone_A3 = Zone('A3','6500',['AA','AB','AC','AD','AE','AF'],[35,50])
    Event_1_zone_B1 = Zone('B1','5500',['BA','BB','BC','BD','BE','BF','BG','BH','BJ','BK','BL','BM'],[1,16])
    Event_1_zone_B2 = Zone('B2','5500',['BA','BB','BC','BD','BE','BF','BG','BH','BJ','BK','BL','BM'],[17,34])
    Event_1_zone_B3 = Zone('B3','5500',['BA','BB','BC','BD','BE','BF','BG','BH','BJ','BK','BL','BM'],[35,50])
    Event_1_zone_C1 = Zone('C1','4500',['CA','CB','CD','CE'],[1,16])
    Event_1_zone_C2 = Zone('C2','4500',['CA','CB','CD','CE'],[17,34])
    Event_1_zone_C3 = Zone('C3','4500',['CA','CB','CD','CE'],[35,50])
    Event_1_zone_D1 = Zone('D1','3500',['DA','DB'],[1,16])
    Event_1_zone_D2 = Zone('D2','3500',['DA','DB'],[17,34])
    Event_1_zone_D3 = Zone('D3','3500',['DA','DB'],[35,50])
    
    Event_1_zone_list = [Event_1_zone_A1,Event_1_zone_A2,Event_1_zone_A3,Event_1_zone_B1,Event_1_zone_B2,Event_1_zone_B3,Event_1_zone_C1,Event_1_zone_C2,Event_1_zone_C3,Event_1_zone_D1,Event_1_zone_D2,Event_1_zone_D3]
    
    for zone in Event_1_zone_list:
        Event_1.add_zone(zone)

    Event_1.add_show(Event_1_Show_1)
    A_row = ['AA','AB','AC','AD','AE','AF']
    A_col = [1,50]
    for row in A_row:
        for col in range(A_col[0],A_col[1]+1):
            Hall_1.add_hall_seat(HallSeat(row+'-'+str(col)))
    B_row = ['BA','BB','BC','BD','BE','BF','BG','BH','BJ','BK','BL','BM']
    B_col = [1,50]
    for row in B_row:
        for col in range(B_col[0],B_col[1]+1):
            Hall_1.add_hall_seat(HallSeat(row+'-'+str(col)))
    C_row = ['CA','CB','CD','CE']
    C_col = [1,50]
    for row in C_row:
        for col in range(C_col[0],C_col[1]+1):
            Hall_1.add_hall_seat(HallSeat(row+'-'+str(col)))
    D_row = ['DA','DB']
    D_col = [1,50]
    for row in D_row:
        for col in range(D_col[0],D_col[1]+1):
            Hall_1.add_hall_seat(HallSeat(row+'-'+str(col)))
    
    # for seat in Hall_1.seat_list:
    #     print(seat.seat_no)

    Hall_2 = Hall('หอแสดงดนตรี วิทยาลัยดุริยางคศิลป์ ม.มหิดล(ศาลายา)')
    Event_2 = Event('Music@Mahidol 2024','12-03-2567',Hall_2,'16-12-2566-10:00-AM','ON SALE NOW',
'''ช่องทางการจำหน่ายบัตรและชำระเงิน
เริ่มจำหน่ายบัตร วันอังคารที่ 5 มีนาคม 2567 ตั้งแต่เวลา 13:00 น. เป็นต้นไป ทุกช่องทางการจำหน่าย 
จะเปิดจำหน่ายบัตรและชำระเงินเฉพาะช่องทางดังต่อไปนี้
 
1.เคาน์เตอร์ไทยทิคเก็ตเมเจอร์ 11 สาขาหลัก / โรงภาพยนตร์เมเจอร์ซีนีเพล็กซ์และอีจีวี / ไปรษณีย์ไทย / บิ๊กซี และ โลตัส
ตรวจสอบจุดจำหน่ายได้ที่ >> https://corporate.thaiticketmajor.com/outlet-location.php
สามารถชำระเงินได้ดังนี้
   - บัตรเครดิตหรือบัตรเดบิต (มีค่าธรรมเนียม 3%)
   - เงินสด
 
2. ทางเว็บไซต์  www.thaiticketmajor.com *ไม่มีการรันคิวหน้าเว็บไซต์*
สามารถชำระเงินได้ดังนี้
   - บัตรเครดิตหรือบัตรเดบิต (มีค่าธรรมเนียม 3%)
   - ชำระทันทีผ่านแอปพลิเคชัน K Pay Plus, BBL iBanking / Shopee Pay, True Money, Alipay, WeChat pay (มีค่าธรรมเนียม 3%)
 
3. ทาง TTM Call Center 02-262-3456 สามารถชำระเงินได้ดังนี้
   - ชำระทันทีผ่านแอปพลิเคชัน K Pay Plus

เงื่อนไขการซื้อบัตร
• ไม่จำกัดจำนวนการซื้อบัตร
• ราคาบัตรยังไม่รวมค่าธรรมเนียมการออกบัตร รวมใบละ 30 บาท
• โปรดระวังมิจฉาชีพที่แฝงมาในรูปแบบต่างๆ เช่น การรับจองบัตร การให้โค้ดจอง การซื้อ-ขายบัตรนอกระบบ การแอบอ้างเป็นพนักงานบริษัทฯ เป็นต้น
• การนำบัตรไปขายต่อหรือแจกเพื่อการโฆษณาหรือประชาสัมพันธ์โดยไม่ได้รับอนุญาตจากบริษัทฯ ถือว่ามีความผิดทางกฏหมาย''')
    
    Event_2_Show_1 = Show(Event_2,'12-03-2567','19:00-PM')

    Event_2_zone_A1 = Zone('A1','200',['A','B','C','D','E','F'],[1,7])
    Event_2_zone_A2 = Zone('A2','200',['A','B','C','D','E','F'],[8,19])
    Event_2_zone_A3 = Zone('A3','200',['A','B','C','D','E','F'],[20,26])
    Event_2_zone_B1 = Zone('B1','200',['G','H','I','J','K','L','M','N'],[1,7])
    Event_2_zone_B2 = Zone('B2','200',['G','H','I','J','K','L','M','N'],[8,19])
    Event_2_zone_B3 = Zone('B3','200',['G','H','I','J','K','L','M','N'],[20,26])

    Event_2_zone_list = [Event_2_zone_A1,Event_2_zone_A2,Event_2_zone_A3,Event_2_zone_B1,Event_2_zone_B2,Event_2_zone_B3]
    for zone in Event_2_zone_list:
        Event_2.add_zone(zone)

    Event_2.add_show(Event_2_Show_1)

    A_row = ['A','B','C','D','E','F']
    A_col = [1,26]
    for row in A_row:
        for col in range(A_col[0],A_col[1]+1):
            Hall_2.add_hall_seat(HallSeat(row+'-'+str(col)))
    B_row = ['G','H','I','J','K','L','M','N']
    B_col = [1,26]
    for row in B_row:
        for col in range(B_col[0],B_col[1]+1):
            Hall_2.add_hall_seat(HallSeat(row+'-'+str(col)))

    Hall_3 = Hall('ยูโอบี ไลฟ์')
    Event_3 = Event('Tom Jones : Ages & Stage Tour - Bangkok','14-03-2567',Hall_3,'16-12-2566-10:00-AM','ON SALE NOW','''
UOB Presale
ผู้มีบัตรเครดิต UOB รับสิทธิ์ซื้อบัตรในรอบ Pre-sale ได้ โดยใช้บัตรเครดิต UOB ในการชำระเงิน ในวันที่ 15 ธันวาคม 2566 เวลา 10:00 น. - 22:00 น. เปิดจำหน่ายทางออนไลน์ที่  www.thaiticketmajor.com
***การซื้อบัตรในวันที่ 15 ธันวาคม 2566  โปรดกดเพื่อรอรับคิวซื้อบัตรได้ที่หน้าเว็บไซต์ตั้งแต่เวลา 9.00 น.
(สมาชิกบัตรเครดิตซิตี้สามารถใช้สิทธิ์ดังกล่าวได้)
 
เปิดจำหน่ายบัตรทั่วไป
เปิดจำหน่ายบัตรทั่วไปวันที่ 16 ธันวาคม 2566 เวลา 10:00 น. ทางออนไลน์ที่  www.thaiticketmajor.com เท่านั้น และเปิดจำหน่ายครบทุกช่องทางวันที่ 17 ธันวาคม 2566  ตั้งแต่เวลา 10.00 น. เป็นต้นไป
 
• ลูกค้า 1 ท่าน ซื้อบัตรได้ไม่เกิน 6 ใบ
• บัตร Pre-sale มีจำนวนจำกัด ซื้อก่อนมีสิทธิก่อน 
• เมื่อซื้อบัตร ท่านจะต้องระบุชื่อ-นามสกุลของผู้ที่เข้าชมคอนเสิร์ตทุกที่นั่ง ตรงกับบัตรประชาชน โดยระบุเป็นภาษาไทย หรือภาษาอังกฤษเท่านั้น ชื่อดังกล่าวจะถูกพิมพ์ลงบนบัตร และไม่สามารถเปลี่ยนแปลงได้ โปรดตรวจสอบชื่อ-นามสกุลให้ถูกต้องก่อนชำระเงิน
• การซื้อบัตรออนไลน์ จะรับชำระเงินผ่านบัตรเครดิต, บัตรเดบิต, KPay+, True Wallet และ Shopee Pay เท่านั้น
• การชำระเงินผ่านบัตรเครดิต, บัตรเดบิต, True Wallet , Shopee Pay มีค่าธรรมเนียม convenience fee 3 % สำหรับการชำระเงินผ่าน BBL iBanking , K Pay+ มีค่าธรรมเเนียม 0.5%
Live Nation Tero ชวนเหล่าวัยรุ่นทุกยุคมารำลึกความหลังจ๊าบๆ ไปกับศิลปินระดับตำนาน “Tom Jones” (ทอม โจนส์) กับทัวร์คอนเสิร์ตครั้งใหม่ที่หลายคนตั้งตารอ “Tom Jones: Ages & Stages Tour in Bangkok” (ทอม โจนส์ : เอจส์ แอนด์ สเตจส์ ทัวร์ อิน แบงค็อก) เตรียมหูเคลือบเพชรไปกับเพลงฮิตตลอดกาลในโชว์สุดประทับใจ 14 มีนาคม 2567 ที่ ยูโอบี ไลฟ์ เปิดจำหน่ายบัตรรอบสมาชิกไลฟ์ เนชั่น เทโร 15 ธันวาคมนี้
 
Tom Jones ศิลปินรุ่นใหญ่ชาวบริทิช ผู้มาพร้อมกับเสียงทรงพลังที่ทรงอิทธิพลในวงการดนตรีมานานกว่า 60 ปีนับตั้งแต่ยุค 1960s เคยคว้ารางวัลประวัติศาสตร์อย่าง GRAMMY Awards ® สาขา Best New Artist เมื่อปี 1966 รวมทั้งเป็นเจ้าของเพลงฮิตติดหูมากมาย ส่งต่อจากรุ่นสู่รุ่นจนมียอดขายรวมกว่า 100 ล้านอัลบั้ม ซึ่งด้วยพลังที่ส่งผ่านเสียงร้องและเพลงของเขามาอย่างยาวนาน Tom Jones ยังได้ชื่อว่าเป็นศิลปินที่เข้าถึงคนฟังได้ทุกเพศ ทุกวัยอย่างไม่เคยตกยุคสมัย 
พิสูจน์ด้วย “Surrounded By Time” อัลบั้มเมื่อปี 2021 ที่พาเขาแซงหน้า Bob Dylan สร้างสถิติใหม่อย่างการศิลปินชายอายุมากที่สุดที่ได้ขึ้นไปอยู่บนอันดับ 1 ของชาร์ตเพลงในอังกฤษ ส่วนในบทบาทอื่นๆ Tom Jones เคยร่วมเป็นหนึ่งในโค้ชของรายการ The Voice UK ซึ่งทำให้เขากลายเป็นที่รู้จักอีกครั้งในฐานะนักร้องรุ่นใหญ่ที่เข้ากับรุ่นเล็กได้เป็นอย่างดี และนอกจากนี้ เขายังเคยเป็นนักแสดงในภาพยนตร์ Mars Attacks และ Playhouse Presents: King of The Teds อีกด้วย                

เงื่อนไขการซื้อบัตร
• เมื่อซื้อบัตรคอนเสิร์ต ท่านจะต้องระบุชื่อ-นามสกุลที่ตรงกับบัตรประชาชนของผู้ที่เข้าชมคอนเสิร์ตทุกที่นั่ง โดยระบุเป็นภาษาไทย หรือภาษาอังกฤษเท่านั้น ชื่อดังกล่าวจะถูกพิมพ์ลงบนบัตรคอนเสิร์ต และไม่สามารถเปลี่ยนแปลงได้ โปรดตรวจสอบชื่อ-นามสกุลให้ถูกต้องก่อนชำระเงิน
• ท่านอาจะถูกร้องขอให้แสดงบัตรประชาชนของท่านในวันคอนเสิร์ต โดยชื่อบนบัตรคอนเสิร์ตจะต้องตรงกับบัตรประชาชนของท่าน กรณีบัตรคอนเสิร์ตที่มีชื่อผู้เข้าชมซ้ำกันมากกว่า 1 ใบ ให้ผู้เข้าชมที่เป็นเจ้าของบัตรคอนเสิร์ตมาแสดงตัวพร้อมด้วยบัตรคอนเสิร์ตและบัตรประชาชน เพื่อยืนยันพร้อมกับผู้เข้าชมท่านอื่นๆ หากผิดเงื่อนไข ทางผู้จัดของสงวนสิทธิ์ในการปฏิเสธไม่ให้เข้าชมการแสดง และจะไม่รับผิดชอบในความเสียหายใดๆ ที่อาจเกิดขึ้น
• โปรดระวังมิจฉาชีพที่แฝงมาในรูปแบบต่างๆ เช่น การรับจองบัตรคอนเสิร์ต การให้โค้ดจอง การซื้อ-ขายบัตรคอนเสิร์ตนอกระบบ การแอบอ้างเป็นพนักงานของบริษัทผู้จัดงานฯ เป็นต้น โปรดทราบว่า ทางผู้จัดงานขอสงวนสิทธิ์ในการให้สิทธิประโยชน์ของบัตรชมคอนเสิร์ตโดยยึดตามข้อมูลของผู้ซื้อบัตรคอนเสิร์ตจากผู้จัดเท่านั้น และจะไม่รับผิดชอบใดๆ หากเกิดความเสียหายในกรณีที่ลูกค้าซื้อบัตรคอนเสิร์ตจากบุคคลที่สาม ทั้งนี้ การตัดสินของผู้จัดงาน ถือเป็นที่สิ้นสุด 
• การนำบัตรคอนเสิร์ตไปขายต่อหรือแจกเพื่อการโฆษณาหรือประชาสัมพันธ์ หรือเพื่อจัดกิจกรรมส่งเสริมการขายใดๆ โดยไม่ได้รับอนุญาตจากผู้จัดงาน ถือว่าผิดเงื่อนไข ผู้จัดงานมีสิทธิยกเลิกบัตรคอนเสิร์ตหรือปฏิเสธไม่ให้เข้าชมการแสดง รวมถึงยกเลิกสิทธิประโยชน์ใดๆ ของบัตรคอนเสิร์ตที่ขายต่อหรือแจกจ่ายโดยไม่ได้รบอนุญาตนั้น 
• บัตรคอนเสิร์ตที่ซื้อแล้วไม่สามารถเปลี่ยนรอบและไม่สามารถเปลี่ยนที่นั่งได้
• บัตรคอนเสิร์ตเป็นทรัพย์สินของผู้จัดงาน ไม่อนุญาตให้นำไปจำหน่ายต่อ ขอคืนเงิน แลกเปลี่ยน หรือ โอนสิทธิในบัตรแก่ผู้อื่น หากตรวจสอบและพบหลักฐานการกระทำดังกล่าว ผู้จัดงานขอสงวนสิทธิ์ในการยกเลิกการจองในกรณียังไม่ชำระเงินหรือในกรณีที่ชำระเงินแล้วผู้จัดงานมีสิทธิยกเลิกบัตรคอนเสิร์ตโดยไม่ต้องแจ้งให้ทราบล่วงหน้าและไม่คืนเงินทุกกรณี และมีสิทธินำบัตรคอนเสิร์ตกลับคืนสู่ระบบเพื่อจำหน่ายใหม่อีกครั้ง 
• โปรดตรวจสอบเงื่อนไขเพิ่มเติมได้ที่ http://www.thaiticketmajor.com/variety/info/6134/
• การซื้อบัตรคอนเสิร์ตหมายถึงผู้ซื้อยอมรับตามข้อตกลงที่ทางผู้จัดงานกำหนดข้างต้นแล้วทุกประการ
                    
''')
    Event_3_Show_1 = Show(Event_3,'14-03-2567','20:00-PM')

    Event_3_zone_G1 = Zone('G1','6300',['AA','AB','AC','AD','AE','AF'],[1,16])
    Event_3_zone_G2 = Zone('G2','6300',['AA','AB','AC','AD','AE','AF'],[17,34])
    Event_3_zone_A1 = Zone('A1','4800',['AA','AB','AC','AD','AE','AF'],[1,16])
    Event_3_zone_A2 = Zone('A2','4800',['AA','AB','AC','AD','AE','AF'],[17,34])
    Event_3_zone_A3 = Zone('A3','4800',['AA','AB','AC','AD','AE','AF'],[35,50])
    Event_3_zone_A4 = Zone('A4','4800',['AA','AB','AC','AD','AE','AF'],[35,50])
    Event_3_zone_B1 = Zone('B1','3800',['AA','AB','AC','AD','AE','AF'],[35,50])
    Event_3_zone_B2 = Zone('B2','3800',['AA','AB','AC','AD','AE','AF'],[35,50])

    Event_list = [Event_1,Event_2,Event_3]
    for event in Event_list:
        WebController.add_event(event)
create_instance()
